Release v1.2.0
